# 2. DataFrame
2-dimensional data

## Setting Up Data

In [4]:
data = {
    'name' : ['Sally', 'David', 'Daniel', 'Peter'],
    'school' : ['Biola', 'UCI', 'Navy', 'Emery'],
    'height' : [157, 173, 175, 130],
    'English' : [97, 78, 95, 100] ,
    'Math' : [89, 100, 78, 97],
    'Science' : [88, 98, 94, 97],
    'SWskills' : ['C++', 'Python', 'Java', 'Swift']
}
data

{'name': ['Sally', 'David', 'Daniel', 'Peter'],
 'school': ['Biola', 'UCI', 'Navy', 'Emery'],
 'height': [157, 173, 175, 130],
 'English': [97, 78, 95, 100],
 'Math': [89, 100, 78, 97],
 'Science': [88, 98, 94, 97],
 'SWskills': ['C++', 'Python', 'Java', 'Swift']}

In [5]:
data['name']

['Sally', 'David', 'Daniel', 'Peter']

In [6]:
data['height']

[157, 173, 175, 130]

## Create DataFrame

In [10]:
import pandas as pd
df = pd.DataFrame(data)

In [9]:
df

     name school  height  English  Math  Science SWskills
0   Sally  Biola     157       97    89       88      C++
1   David    UCI     173       78   100       98   Python
2  Daniel   Navy     175       95    78       94     Java
3   Peter  Emery     130      100    97       97    Swift

## Access Data

In [11]:
df['name']

0     Sally
1     David
2    Daniel
3     Peter
Name: name, dtype: object

In [12]:
df['height']

0    157
1    173
2    175
3    130
Name: height, dtype: int64

In [13]:
df[['name', 'height']]

     name  height
0   Sally     157
1   David     173
2  Daniel     175
3   Peter     130

## DataFrame set Index

In [15]:
df = pd.DataFrame(data, index = ['1st', '2nd', '3rd', '4th'])
df

       name school  height  English  Math  Science SWskills
1st   Sally  Biola     157       97    89       88      C++
2nd   David    UCI     173       78   100       98   Python
3rd  Daniel   Navy     175       95    78       94     Java
4th   Peter  Emery     130      100    97       97    Swift

## DataFrame set column
choose the column from the data, or change the order

In [19]:
df = pd.DataFrame(data, columns = ['name', 'school', 'height'])
df

     name school  height
0   Sally  Biola     157
1   David    UCI     173
2  Daniel   Navy     175
3   Peter  Emery     130

In [20]:
df = pd.DataFrame(data, columns = ['name', 'height', 'school'])
df

     name  height school
0   Sally     157  Biola
1   David     173    UCI
2  Daniel     175   Navy
3   Peter     130  Emery